<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/05.%20Function%20and%20Method%20DataFrame%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Intro**

In [1]:
# from google.colab import drive
# drive.mount('/content/drive/')

In [2]:
# "/content/drive/My Drive/Colab Notebooks/Wooky Pandas/diamonds-1.csv"
# Membaca data dan memasukannya kedalam suatu variabel
# url = 'https://blog.sanbercode.com/wp-content/uploads/2020/04/diamonds-1.csv'

# import pandas as pd
# df_from_csv = pd.read_csv("https://drive.google.com/uc?id=13jtHSMJIa8gzYncyus2o2uTm-H_LFN0B")
# df_from_csv

In [3]:
# diamonds-1.csv
import pandas as pd
df_from_csv = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/diamonds-1.csv')
df_from_csv

       Unnamed: 0  carat        cut color  ... price     x     y     z
0               1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
1               2   0.21    Premium     E  ...   326  3.89  3.84  2.31
2               3   0.23       Good     E  ...   327  4.05  4.07  2.31
3               4   0.29    Premium     I  ...   334  4.20  4.23  2.63
4               5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

## .index

In [4]:
#mengubah index table dari salah satu column
df = pd.DataFrame(df_from_csv)
df.index = df['carat']
df

       Unnamed: 0  carat        cut color  ... price     x     y     z
carat                                      ...
0.23            1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
0.21            2   0.21    Premium     E  ...   326  3.89  3.84  2.31
0.23            3   0.23       Good     E  ...   327  4.05  4.07  2.31
0.29            4   0.29    Premium     I  ...   334  4.20  4.23  2.63
0.31            5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
0.72        53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
0.72        53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
0.70        53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
0.86        53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
0.75        53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

## .columns

In [5]:
# Menampilkan semua column
df.columns

Index(['Unnamed: 0', 'carat', 'cut', 'color', 'clarity', 'depth', 'table',
       'price', 'x', 'y', 'z'],
      dtype='object')

## .values

In [6]:
df.values

array([[1, 0.23, 'Ideal', ..., 3.95, 3.98, 2.43],
       [2, 0.21, 'Premium', ..., 3.89, 3.84, 2.31],
       [3, 0.23, 'Good', ..., 4.05, 4.07, 2.31],
       ...,
       [53938, 0.7, 'Very Good', ..., 5.66, 5.68, 3.56],
       [53939, 0.86, 'Premium', ..., 6.15, 6.12, 3.74],
       [53940, 0.75, 'Ideal', ..., 5.83, 5.87, 3.64]], dtype=object)

## .keys()

In [7]:
df.keys()

Index(['Unnamed: 0', 'carat', 'cut', 'color', 'clarity', 'depth', 'table',
       'price', 'x', 'y', 'z'],
      dtype='object')

#**Head and Tail**

Pandas memiliki beberapa method untuk memahami gambaran besar karakteristik dari data kita. diantaranya adalah :

*   head()
*   tail()

**head()** adalah secara default adalah untuk melihat 5 pertama data kita

**tail()** secara default untuk melihat 5 data kita dari terakhir. kita bisa mengganti jumlah data yang akan di tampilkan dengan memberikan data integer sebagai argument terhadap metode tersebut. 

contohnya sebagai berikut :

## Membaca Data Dari File CSV

In [8]:
# "/content/drive/My Drive/Colab Notebooks/Wooky Pandas/diamonds-1.csv"
# Membaca data dan memasukannya kedalam suatu variabel

# url = 'https://blog.sanbercode.com/wp-content/uploads/2020/04/diamonds-1.csv'

# import pandas as pd
# df_from_csv = pd.read_csv("https://drive.google.com/uc?id=13jtHSMJIa8gzYncyus2o2uTm-H_LFN0B")
# df_from_csv

In [9]:
# diamonds-1.csv
import pandas as pd
df_from_csv = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/diamonds-1.csv')
df_from_csv

       Unnamed: 0  carat        cut color  ... price     x     y     z
0               1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
1               2   0.21    Premium     E  ...   326  3.89  3.84  2.31
2               3   0.23       Good     E  ...   327  4.05  4.07  2.31
3               4   0.29    Premium     I  ...   334  4.20  4.23  2.63
4               5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

## Head( ) and Head(n)

In [10]:
# 5 data pertama
df_from_csv.head()

   Unnamed: 0  carat      cut color clarity  ...  table  price     x     y     z
0           1   0.23    Ideal     E     SI2  ...   55.0    326  3.95  3.98  2.43
1           2   0.21  Premium     E     SI1  ...   61.0    326  3.89  3.84  2.31
2           3   0.23     Good     E     VS1  ...   65.0    327  4.05  4.07  2.31
3           4   0.29  Premium     I     VS2  ...   58.0    334  4.20  4.23  2.63
4           5   0.31     Good     J     SI2  ...   58.0    335  4.34  4.35  2.75

[5 rows x 11 columns]

In [11]:
# data pertama dengan spesified much data
df_from_csv.head(2)

   Unnamed: 0  carat      cut color clarity  ...  table  price     x     y     z
0           1   0.23    Ideal     E     SI2  ...   55.0    326  3.95  3.98  2.43
1           2   0.21  Premium     E     SI1  ...   61.0    326  3.89  3.84  2.31

[2 rows x 11 columns]

## Tail( ) and Tail(n)

In [12]:
# 5 data terakhir
df_from_csv.tail()

       Unnamed: 0  carat        cut color  ... price     x     y     z
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[5 rows x 11 columns]

In [13]:
# data pertama dengan spesified much data
df_from_csv.tail(2)

       Unnamed: 0  carat      cut color clarity  ...  table  price     x     y     z
53938       53939   0.86  Premium     H     SI2  ...   58.0   2757  6.15  6.12  3.74
53939       53940   0.75    Ideal     D     SI2  ...   55.0   2757  5.83  5.87  3.64

[2 rows x 11 columns]

## Task
Mencoba suatu metode dari pandas untuk mengetahui beberapa data pertama dan beberapa data terakhir. kemudian sebutkan nilai dari:
- baris pertama dari column price
- baris terakhir dari column color

In [14]:
# code here
# Dengan index
df_from_csv['price'][[0]]
# Dengan method loc
df_from_csv.loc[0, ['price']]
# Dengan method iloc
df_from_csv['price'].iloc[[0]]
# Dengan method head
df_from_csv['price'].head(1)

0    326
Name: price, dtype: int64

In [15]:
# Dengan index
df_from_csv['color'][[len(df_from_csv)-1]]
# Dengan method tail()
df_from_csv['color'].tail(1)

53939    D
Name: color, dtype: object

# **Info and Describe**

*   info()

**info()** adalah suatu method untuk melakukan summary terhadap data yang memberikan informasi tentang tipe dari index data, tipe dari column data, non-null values pada setiap column dan jumlah memory yang digunakan.

*   describe()

describe() adalah sutau metode yang menghasilkan kesimpulan deskriptif statistik dari data. kesimpulan deskriptif statistik yang dihasilkan adalah seperti central tendency, dispersi dan bentuk distributsi dari data. untuk mengetahui lebih dalam tentang deskriptik statistik silahkan baca artikel ini.

## Info

In [16]:
# code here
#df_from_csv.info()
#or
data_desc = df_from_csv.info()
data_desc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  53940 non-null  int64
 1   carat       53940 non-null  float64
 2   cut         53940 non-null  object
 3   color       53940 non-null  object
 4   clarity     53940 non-null  object
 5   depth       53940 non-null  float64
 6   table       53940 non-null  float64
 7   price       53940 non-null  int64
 8   x           53940 non-null  float64
 9   y           53940 non-null  float64
 10  z           53940 non-null  float64
dtypes: float64(6), int64(2), object(3)
memory usage: 4.5+ MB

## Describe

In [17]:
# code here
#df_from_csv.describe()
#or
data_desc = df_from_csv.describe()
data_desc

         Unnamed: 0         carat  ...             y             z
count  53940.000000  53940.000000  ...  53940.000000  53940.000000
mean   26970.500000      0.797940  ...      5.734526      3.538734
std    15571.281097      0.474011  ...      1.142135      0.705699
min        1.000000      0.200000  ...      0.000000      0.000000
25%    13485.750000      0.400000  ...      4.720000      2.910000
50%    26970.500000      0.700000  ...      5.710000      3.530000
75%    40455.250000      1.040000  ...      6.540000      4.040000
max    53940.000000      5.010000  ...     58.900000     31.800000

[8 rows x 8 columns]

## Task

- Gunakan suatu metode dari pandas untuk mengetahui deskriptif statistik dari suatu data
- Berapa nilai rata-rata dari column price
- Berapa nilai standar deviasi dari column depth
- Berapa nilai maximum dari column carat

**Mean**

In [18]:
df_from_csv['price'].describe().loc['mean']  # type() = float64

3932.799721913237

In [19]:
df_from_csv['price'].describe().loc[['mean']]  # type() = pandas.core.series.Series

mean    3932.799722
Name: price, dtype: float64

In [20]:
df_from_csv[['price']].describe().loc['mean']  # type() = pandas.core.series.Series

price    3932.799722
Name: mean, dtype: float64

In [21]:
df_from_csv[['price']].describe().loc[['mean']] # type() = pandas.core.frame.DataFrame

            price
mean  3932.799722

**Standard** **Deviasi**

In [22]:
df_from_csv['depth'].describe().loc[['std']]

std    1.432621
Name: depth, dtype: float64

**Max**

In [23]:
df_from_csv['carat'].describe().loc[['max']]

max    5.01
Name: carat, dtype: float64

# Statistika Function

In [24]:
import pandas as pd
data = [[1,2,3], [4,5,6], [7,8,9], [10, 11, 12]]
df = pd.DataFrame(data, columns=['angka1', 'angka2', 'angka3'])
df

   angka1  angka2  angka3
0       1       2       3
1       4       5       6
2       7       8       9
3      10      11      12

## Describe (Count, Mean, Std, Min, Max)

In [25]:
print(df['angka1'].describe(), end='\n\n')
print(df['angka2'].describe(), end='\n\n')
print(df['angka3'].describe(), end='\n\n')
df.describe()

count     4.000000
mean      5.500000
std       3.872983
min       1.000000
25%       3.250000
50%       5.500000
75%       7.750000
max      10.000000
Name: angka1, dtype: float64

count     4.000000
mean      6.500000
std       3.872983
min       2.000000
25%       4.250000
50%       6.500000
75%       8.750000
max      11.000000
Name: angka2, dtype: float64

count     4.000000
mean      7.500000
std       3.872983
min       3.000000
25%       5.250000
50%       7.500000
75%       9.750000
max      12.000000
Name: angka3, dtype: float64

          angka1     angka2     angka3
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

## Count

In [26]:
print(df['angka1'].count(), end='\n\n')
print(df['angka2'].count(), end='\n\n')
print(df['angka3'].count(), end='\n\n')
df.count()

4

4

4

angka1    4
angka2    4
angka3    4
dtype: int64

## value_counts

## Mean
df.mean?

In [27]:
df.mean?

In [28]:
print(df['angka1'].mean(), end='\n\n')
print(df['angka2'].mean(), end='\n\n')
print(df['angka3'].mean(), end='\n\n')
df.mean()

5.5

6.5

7.5

angka1    5.5
angka2    6.5
angka3    7.5
dtype: float64

## Median

In [29]:
print(df['angka1'].median(), end='\n\n')
print(df['angka2'].median(), end='\n\n')
print(df['angka3'].median(), end='\n\n')
df.median()

5.5

6.5

7.5

angka1    5.5
angka2    6.5
angka3    7.5
dtype: float64

## Std

In [30]:
print(df['angka1'].std(), end='\n\n')
print(df['angka2'].std(), end='\n\n')
print(df['angka3'].std(), end='\n\n')
df.std()

3.872983346207417

3.872983346207417

3.872983346207417

angka1    3.872983
angka2    3.872983
angka3    3.872983
dtype: float64

## Min

In [31]:
print(df['angka1'].min(), end='\n\n')
print(df['angka2'].min(), end='\n\n')
print(df['angka3'].min(), end='\n\n')
df.min()

1

2

3

angka1    1
angka2    2
angka3    3
dtype: int64

## Max

In [32]:
print(df['angka1'].max(), end='\n\n')
print(df['angka2'].max(), end='\n\n')
print(df['angka3'].max(), end='\n\n')
df.max()

10

11

12

angka1    10
angka2    11
angka3    12
dtype: int64

## Apply()

Banyak digunakan pada Transformasi Data

In [33]:
df

   angka1  angka2  angka3
0       1       2       3
1       4       5       6
2       7       8       9
3      10      11      12

contohnya menjadikan nilai dari column angka3 menjadi hasil dari (angka1 - angka2)

In [34]:
def minus_minimum(x):
    return x - x.min()

df[['angka4']] = df[['angka3']].apply(minus_minimum)
df

   angka1  angka2  angka3  angka4
0       1       2       3       0
1       4       5       6       3
2       7       8       9       6
3      10      11      12       9

## **.sum()**

# **.copy()**

In [35]:
import pandas as pd
data = {'Nama': ['Nur Imam Masri', 'Nur Abrar Masri', 'Nur Muthia Fadhilah', 'Nur Pratami'], 'Umur':[12, 34, 55, 67]}
df = pd.DataFrame(data)
df

                  Nama  Umur
0       Nur Imam Masri    12
1      Nur Abrar Masri    34
2  Nur Muthia Fadhilah    55
3          Nur Pratami    67

In [36]:
df1 = df.iloc[0,0:2].copy() # To avoid the case where changing df1 also changes df

# **.iterrows()**

In [37]:
import pandas as pd
dta = {'A': [2, 3], 'B':[3, 4], 'C':[4, 5]}
df = pd.DataFrame(dta)
df

   A  B  C
0  2  3  4
1  3  4  5

In [38]:
df1= pd.DataFrame() #creating an empty dataframe
for index,i in df.iterrows():
  df1.loc[index,'A']=df.loc[index,'A']
  df1.loc[index,'B']=df.loc[index,'B']
df1

     A    B
0  2.0  3.0
1  3.0  4.0

#**Len(DataFrame)**

In [39]:
import pandas as pd
data = [[1,2,3], [4,5,6], [7,8,9], [10, 11, 12]]
df = pd.DataFrame(data, columns=['angka1', 'angka2', 'angka3'])
len(df['angka1'])

4

# **Shape**

*df.shape* would give you the number of rows and columns.

In [40]:
import pandas as pd
data = [[1,2,3], [4,5,6], [7,8,9], [10, 11, 12]]
df = pd.DataFrame(data, columns=['angka1', 'angka2', 'angka3'])
print('shape = ', df.shape)
print('shape angka1 = ', df['angka1'].shape)
print('shape angka2 = ', df['angka2'].shape)
print('shape angka3 = ', df['angka3'].shape)

shape =  (4, 3)
shape angka1 =  (4,)
shape angka2 =  (4,)
shape angka3 =  (4,)

# **.reindex()**

df.reindex(labels=None, index=None, columns=None, axis=None, method=None, copy=True, level=None, fill_value=nan, limit=None, tolerance=None)

In [41]:
# df.reindex?

In [42]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                   'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                   index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [43]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [44]:
df.reindex(new_index, fill_value=0)

               http_status  response_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [45]:
df.reindex(new_index, fill_value='missing')

              http_status response_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [46]:
# We can also reindex the columns.
df.reindex(columns=['http_status', 'user_agent'])

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [47]:
# Or we can use "axis-style" keyword arguments
df.reindex(['http_status', 'user_agent'], axis="columns")

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

# **.drop()**

# **.drop_duplicates()**

In [48]:
import pandas as pd
data = [[1,1,2], [1,2,62], [7,2,7], [10, 11, 62]]
df = pd.DataFrame(data, columns=['angka1', 'angka2', 'angka3'])
df

   angka1  angka2  angka3
0       1       1       2
1       1       2      62
2       7       2       7
3      10      11      62

In [49]:
df['angka1'].drop_duplicates()

0     1
2     7
3    10
Name: angka1, dtype: int64

# **Add()**

Mari ambil contoh function add(), dimana kita akan berusaha untuk menambahkan dua data frames sebagai berikut:

In [50]:
import pandas as pd
 
dictionary_1 = {'A' : [5, 8, 10, 3, 9], 'B' : [6, 1, 4, 8, 7]}
dictionary_2 = {'A' : [4, 3, 7, 6, 1], 'B' : [9, 10, 10, 1, 2]}

data_frame_1 = pd.DataFrame(dictionary_1)
data_frame_2 = pd.DataFrame(dictionary_2)

print(data_frame_1, end='\n\n')
print(data_frame_2)

    A  B
0   5  6
1   8  1
2  10  4
3   3  8
4   9  7

   A   B
0  4   9
1  3  10
2  7  10
3  6   1
4  1   2

In [51]:
data_frame_3 = data_frame_1.add(data_frame_2)
print(data_frame_3)

    A   B
0   9  15
1  11  11
2  17  14
3   9   9
4  10   9

# **.sample()**

# Corr()

df.corr() , Returns the correlation between columns in a data frame

In [52]:
import pandas as pd
data = {'Angka1': [1,2,3,4,5], 'Angka2':[5,4,3,2,1], 'Angka3':[1,3,5,7,9], 'Angka4':[9,7,5,3,1]}
df = pd.DataFrame(data)
df

   Angka1  Angka2  Angka3  Angka4
0       1       5       1       9
1       2       4       3       7
2       3       3       5       5
3       4       2       7       3
4       5       1       9       1

In [53]:
df.corr()

        Angka1  Angka2  Angka3  Angka4
Angka1     1.0    -1.0     1.0    -1.0
Angka2    -1.0     1.0    -1.0     1.0
Angka3     1.0    -1.0     1.0    -1.0
Angka4    -1.0     1.0    -1.0     1.0

# **Sorting**

It is possible to sort values in a certain column in an ascending order using 

> df.sort_values(col1)

and also in a descending order using 

> df.sort_values(col2,ascending=False)

Furthermore, itâ€™s possible to sort values by col1 in ascending order then col2 in descending order by using 

> df.sort_values([col1,col2],ascending=[True,False])

...........................................

**df.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False)**

## Default Sorting

In [54]:
import pandas as pd
data = {'Nama': ['Sri', 'Imam', 'Muthia', 'Abrar', 'Itha'], 'Umur':[71,45, 12, 34, 70], 'JK':['P', 'L', 'P', 'L', 'P']}
df = pd.DataFrame(data)
df.sort_values('Umur')

     Nama  Umur JK
2  Muthia    12  P
3   Abrar    34  L
1    Imam    45  L
4    Itha    70  P
0     Sri    71  P

In [55]:
df.sort_values('Umur', ignore_index=True)

     Nama  Umur JK
0  Muthia    12  P
1   Abrar    34  L
2    Imam    45  L
3    Itha    70  P
4     Sri    71  P

In [56]:
df

     Nama  Umur JK
0     Sri    71  P
1    Imam    45  L
2  Muthia    12  P
3   Abrar    34  L
4    Itha    70  P

In [57]:
df.sort_values('Umur', inplace=True, ignore_index=True)

In [58]:
df

     Nama  Umur JK
0  Muthia    12  P
1   Abrar    34  L
2    Imam    45  L
3    Itha    70  P
4     Sri    71  P

## Sorting , Parameter Ascending

In [59]:
import pandas as pd
data = {'Nama': ['Sri', 'Imam', 'Muthia', 'Abrar', 'Itha'], 'Umur':[71,45, 12, 34, 70], 'JK':['P', 'L', 'P', 'L', 'P']}
df = pd.DataFrame(data)
df

     Nama  Umur JK
0     Sri    71  P
1    Imam    45  L
2  Muthia    12  P
3   Abrar    34  L
4    Itha    70  P

In [60]:
df.sort_values('Umur', ascending=False)

     Nama  Umur JK
0     Sri    71  P
4    Itha    70  P
1    Imam    45  L
3   Abrar    34  L
2  Muthia    12  P

In [61]:
 import numpy as np
 df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
})
df

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
3  NaN     8     4
4    D     7     2
5    C     4     3

In [62]:
df.sort_values(by=['col1'])

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

In [63]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3
1    A     1     1
0    A     2     0
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

In [64]:
df.sort_values(by='col1', ascending=False)

  col1  col2  col3
4    D     7     2
5    C     4     3
2    B     9     9
0    A     2     0
1    A     1     1
3  NaN     8     4

# .floordiv()

In [65]:
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':90})

df = pd.DataFrame({'matematika':matematika, 'fisika':fisika, 'biologi':biologi})
df

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100       90

In [66]:
df.floordiv(10)

       matematika  fisika  biologi
otong           8       9       10
dinda           9       7        6
mamat          10      10        9

# **.set_index()**

In [67]:
import pandas as pd
raw_data = {'city':['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'],
            'rank':['1st', '2nd', '1st', '2nd', '1st', '2nd'],
            'name':['Noureddin', 'Adam', 'Kevin', 'Raihana', 'Raghas', 'Mahdi'],
            'score1':[44, 48, 39, 41, 38, 44],
            'score2':[67, 63, 55, 70, 64, 77]}
df = pd.DataFrame(raw_data, columns = ['city', 'rank', 'name', 'score1', 'score2'])
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghas      38      64
5   Sydney  2nd      Mahdi      44      77

In [68]:
df.set_index(['city', 'rank'], drop=False)

                 city rank       name  score1  score2
city    rank
Tripoli 1st   Tripoli  1st  Noureddin      44      67
        2nd   Tripoli  2nd       Adam      48      63
Rome    1st      Rome  1st      Kevin      39      55
        2nd      Rome  2nd    Raihana      41      70
Sydney  1st    Sydney  1st     Raghas      38      64
        2nd    Sydney  2nd      Mahdi      44      77

In [69]:
df.set_index(['city', 'rank'], drop=True)

                   name  score1  score2
city    rank
Tripoli 1st   Noureddin      44      67
        2nd        Adam      48      63
Rome    1st       Kevin      39      55
        2nd     Raihana      41      70
Sydney  1st      Raghas      38      64
        2nd       Mahdi      44      77

# **.filter()**

df.filter(items=None, like: Union[str, NoneType]=None, regex: Union[str, NoneType]=None, axis=None) -> ~FrameOrSeries

Parameters
.......................



*   items : list-like

Keep labels from axis which are in items

*   like : str

Keep labels from axis for which "like in label == True".

*   regex : str (regular expression)

Keep labels from axis for which re.search(regex, label) == True.

*   axis : {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™, None}, default None

The axis to filter on, expressed either as an index (int) or axis name (str). By default this is the info axis, 'index' for Series, 'columns' for DataFrame.

In [70]:
df.filter?

In [71]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                   index=['mouse', 'rabbit'],
                   columns=['one', 'two', 'three'])
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [72]:
# select columns by name
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [73]:
# select columns by regular expression
df.filter(regex='e$', axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [74]:
# select rows containing 'bbi'
df.filter(like='bbi', axis=0)

        one  two  three
rabbit    4    5      6

Character	Description	Example	Try it

[]	A set of characters	"[a-m]"	

\	Signals a special sequence (can also be used to escape special characters)	"\d"	

.	Any character (except newline character)	"he..o"	

^	Starts with	"^hello"	

Ends with	"world$"	

Zero or more occurrences	"aix*"

One or more occurrences	"aix+"	

{}	Exactly the specified number of occurrences	"al{2}"	

|	Either or	"falls|stays"	

()	Capture and group

In [75]:
import pandas as pd

import numpy as np

array=np.random.random((2,4))

df=pd.DataFrame(array, columns=('Test1', 'toto', 'test2', 'riri'))
df

      Test1      toto     test2      riri
0  0.417726  0.704510  0.822924  0.883540
1  0.527808  0.823508  0.362465  0.656768

In [76]:
# df = df[df.columns.drop(list(df.filter(regex='Test')))]
df = df.drop(df.filter(regex='Test').columns, axis=1)
df

       toto     test2      riri
0  0.704510  0.822924  0.883540
1  0.823508  0.362465  0.656768

# **Data Cleaning**

## **df.columns = []**

## **.isnull() , .isna() , .notna()**

In [77]:
# pd.isnull?

In [78]:
# Scalar arguments (including strings) result in a scalar boolean.
print(pd.isna('dog'))
print(pd.isna(pd.NA))
print(pd.isna(np.nan))
print(pd.notna('dog'))
print(pd.notna(pd.NA))
print(pd.notna(np.nan))

False
True
True
True
False
False

In [79]:
# ndarrays result in an ndarray of booleans.
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array, end ='\n\n')
print(pd.isna(array), end ='\n\n')
print(pd.notna(array), end ='\n\n')

[[ 1. nan  3.]
 [ 4.  5. nan]]

[[False  True False]
 [False False  True]]

[[ True False  True]
 [ True  True False]]

In [80]:
# For Series and DataFrame, the same type is returned, containing booleans.
df = pd.DataFrame([['ant', 'bee', 'cat'], ['dog', None, 'fly']])
df

     0     1    2
0  ant   bee  cat
1  dog  None  fly

In [81]:
df.isna()

       0      1      2
0  False  False  False
1  False   True  False

In [82]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False

In [83]:
df.notna()

      0      1     2
0  True   True  True
1  True  False  True

In [84]:
pd.isna(df)

       0      1      2
0  False  False  False
1  False   True  False

In [85]:
pd.notna(df)

      0      1     2
0  True   True  True
1  True  False  True

In [86]:
pd.isna(df[1])

0    False
1     True
Name: 1, dtype: bool

In [87]:
pd.notna(df[1])

0     True
1    False
Name: 1, dtype: bool

## **.dropna()**

df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

Parameters

* axis : {0 or 'index', 1 or 'columns'}, default 0

Determine if rows or columns which contain missing values are removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

.. versionchanged:: 1.0.0

 Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

* how : {'any', 'all'}, default 'any'

Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

* thresh : int, optional

Require that many non-NA values.

* subset : array-like, optional

Labels along other axis to consider, e.g. if you are dropping rows these would be a list of columns to include.

* inplace : bool, default False

If True, do operation inplace and return None.

In [88]:
# df.dropna?

In [89]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [90]:
# Drop the rows where at least one element is missing.
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [91]:
# Drop the columns where at least one element is missing.
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [92]:
# Drop the rows where all elements are missing.
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [93]:
# Keep only the rows with at least 2 non-NA values.
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [94]:
# Define in which columns to look for missing values.
df.dropna(subset=['name', 'born'])

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [95]:
# Keep the DataFrame with valid entries in the same variable.
df.dropna(inplace=True)

## **.fillna()**

df.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None) -> Union[_ForwardRef('DataFrame'), NoneType]


Parameters
..................


* value : scalar, dict, Series, or DataFrame

Value to use to fill holes (e.g. 0), alternately a dict/Series/DataFrame of values specifying which value to use for each index (for a Series) or column (for a DataFrame).  Values not in the dict/Series/DataFrame will not be filled. This value cannot be a list.

* method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None

Method to use for filling holes in reindexed Series pad / ffill: propagate last valid observation forward to next valid backfill / bfill: use next valid observation to fill gap.

* axis : {0 or 'index', 1 or 'columns'}

Axis along which to fill missing values.

* inplace : bool, default False

If True, fill in-place. Note: this will modify any other views on this object (e.g., a no-copy slice for a column in a DataFrame).

* limit : int, default None

If method is specified, this is the maximum number of consecutive NaN values to forward/backward fill. In other words, if there is a gap with more than this number of consecutive NaNs, it will only be partially filled. If method is not specified, this is the maximum number of entries along the entire axis where NaNs will be filled. Must be greater than 0 if not None.

* downcast : dict, default is None

A dict of item->dtype of what to downcast if possible, or the string 'infer' which will try to downcast to an appropriate equal type (e.g. float64 to int64 if possible).

In [96]:
# df.fillna?

In [97]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                   columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [98]:
# Replace all NaN elements with 0s.
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [99]:
# We can also propagate non-null values forward or backward.
df.fillna(method='ffill')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [100]:
# Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1, 2, and 3 respectively.
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [101]:
# Only replace the first NaN element.
df.fillna(value=values, limit=1)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4

## **.astype()**

df.astype(dtype, copy: bool=True, errors: str='raise')

Parameters
.........................

* dtype : data type, or dict of column name -> data type

Use a numpy.dtype or Python type to cast entire pandas object to the same type. Alternatively, use {col: dtype, ...}, where col is a column label and dtype is a numpy.dtype or Python type to cast one or more of the DataFrame's columns to column-specific types.

* copy : bool, default True

Return a copy when ``copy=True`` (be very careful setting. 
``copy=False`` as changes to values then may propagate to other pandas objects).

* errors : {'raise', 'ignore'}, default 'raise'

Control raising of exceptions on invalid data for provided dtype.

- ``raise`` : allow exceptions to be raised
- ``ignore`` : suppress exceptions. On error return original object.

In [102]:
df.astype?

In [103]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [104]:
# Cast all columns to int32:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [105]:
# Cast col1 to int32 using a dictionary:
df.astype({'col1': 'int32'}).dtypes

col1    int32
col2    int64
dtype: object

In [106]:
# Note that using ``copy=False`` and changing data on a new pandas object may propagate changes:
s1 = pd.Series([1, 2])
s2 = s1.astype('int64', copy=False)
s2[0] = 10
s1  # note that s1[0] has changed too

0    10
1     2
dtype: int64

## Replace() and Rename() 
It is sometimes necessary to replace values with different values. 

For example, 

> s.replace(1,'one') 

would replace all values equal to 1 with 'one'. 

Itâ€™s possible to do it for multiple values: 

> s.replace([1,3],['one','three']) 

would replace all 1 with 'one' and 3 with 'three'. You can also rename specific columns by running: 

df.rename(columns={'old_name': 'new_ name'}) 

or use df.set_index('column_one') to change the index of the data frame.

### **Replace()**

DataFrame.replace(self, to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad') [source](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html)

Replace values given in to_replace with value.

Values of the DataFrame are replaced with other values dynamically. This differs from updating with **.loc** or **.iloc**, which require you to specify a location to update with some value.

                                **to_replace**

* **to_replace** : str, regex, list, dict, Series, int, float, or None
How to find the values that will be replaced.

numeric, str or regex:

* numeric: numeric values equal to to_replace will be replaced with value

* str: string exactly matching to_replace will be replaced with value

* regex: regexs matching to_replace will be replaced with value

list of str, regex, or numeric:

* First, if to_replace and value are both lists, they must be the same length.

* Second, if regex=True then all of the strings in both lists will be interpreted as regexs otherwise they will match directly. This doesnâ€™t matter much for value since there are only a few possible substitution regexes you can use.

* str, regex and numeric rules apply as above.

dict:

* Dicts can be used to specify different replacement values for different existing values. For example, {'a': 'b', 'y': 'z'} replaces the value â€˜aâ€™ with â€˜bâ€™ and â€˜yâ€™ with â€˜zâ€™. To use a dict in this way the value parameter should be None.

* For a DataFrame a dict can specify that different values should be replaced in different columns. For example, {'a': 1, 'b': 'z'} looks for the value 1 in column â€˜aâ€™ and the value â€˜zâ€™ in column â€˜bâ€™ and replaces these values with whatever is specified in value. The value parameter should not be None in this case. You can treat this as a special case of passing two lists except that you are specifying the column to search in.

* For a DataFrame nested dictionaries, e.g., {'a': {'b': np.nan}}, are read as follows: look in column â€˜aâ€™ for the value â€˜bâ€™ and replace it with NaN. The value parameter should be None to use a nested dict in this way. You can nest regular expressions as well. Note that column names (the top-level dictionary keys in a nested dictionary) cannot be regular expressions.

None:

* This means that the regex argument must be a string, compiled regular expression, or list, dict, ndarray or Series of such elements. If value is also None then this must be a nested dictionary or Series.

                                **value**

*scalar, dict, list, str, regex, default None*

Value to replace any values matching to_replace with. For a DataFrame a dict of values can be used to specify which value to use for each column (columns not in the dict will not be filled). Regular expressions, strings and lists or dicts of such objects are also allowed.

### Scalar `to_replace` and `value`

In [107]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [108]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

### List-like `to_replace`

In [109]:
df.replace([0, 1, 2, 3], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [110]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [111]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace([1, 2], method='bfill')

0    0
1    3
2    3
3    3
4    4
dtype: int64

### dict-like `to_replace`

In [112]:
df.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [113]:
df.replace({'A': 0, 'B': 5}, 100)

     A    B  C
0  100  100  a
1    1    6  b
2    2    7  c
3    3    8  d
4    4    9  e

In [114]:
df.replace({'A': {0: 100, 4: 400}})

     A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

Regular expression `to_replace`

In [115]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                   'B': ['abc', 'bar', 'xyz']})
df.replace(to_replace=r'^ba.$', value='new', regex=True)

      A    B
0   new  abc
1   foo  new
2  bait  xyz

In [116]:
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)

      A    B
0   new  abc
1   foo  bar
2  bait  xyz

In [117]:
df.replace(regex=r'^ba.$', value='new')

      A    B
0   new  abc
1   foo  new
2  bait  xyz

In [118]:
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})

      A    B
0   new  abc
1   xyz  new
2  bait  xyz

In [119]:
df.replace(regex=[r'^ba.$', 'foo'], value='new')

      A    B
0   new  abc
1   new  new
2  bait  xyz

### .rename()

df.rename(mapper=None, index=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='ignore')

Parameters
........................



*   mapper : dict-like or function

Dict-like or functions transformations to apply to that axis' values. Use either ``mapper`` and ``axis`` to specify the axis to target with ``mapper``, or ``index`` and ``columns``.

*   index : dict-like or function

Alternative to specifying axis (``mapper, axis=0`` is equivalent to ``index=mapper``).

*   columns : dict-like or function

Alternative to specifying axis (``mapper, axis=1`` is equivalent to ``columns=mapper``).

*   axis : int or str

Axis to target with ``mapper``. Can be either the axis name ('index', 'columns') or number (0, 1). The default is 'index'.

*   copy : bool, default True

Also copy underlying data.

*  inplace : bool, default False

Whether to return a new DataFrame. If True then value of copy is ignored.


*   level : int or level name, default None

In case of a MultiIndex, only rename labels in the specified level.

*   errors : {'ignore', 'raise'}, default 'ignore'

If 'raise', raise a `KeyError` when a dict-like `mapper`, `index`, or `columns` contains labels that are not present in the Index being transformed.

If 'ignore', existing keys will be renamed and extra keys will be ignored.

In [120]:
df.rename?

In [121]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [122]:
# Rename columns using a mapping:
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [123]:
# Rename index using a mapping:
df.rename(index={0: "x", 1: "y", 2: "z"})

   A  B
x  1  4
y  2  5
z  3  6

In [124]:
# Cast index labels to a different type:
df.index

RangeIndex(start=0, stop=3, step=1)

In [125]:
df.rename(index=float)

     A  B
0.0  1  4
1.0  2  5
2.0  3  6

In [126]:
df.rename(index=float).index

Float64Index([0.0, 1.0, 2.0], dtype='float64')

In [127]:
# Using axis-style parameters
df.rename(str.lower, axis='columns')

   a  b
0  1  4
1  2  5
2  3  6

In [128]:
df.rename({1: 2, 2: 4}, axis='index')

   A  B
0  1  4
2  2  5
4  3  6

In [129]:
df.rename(columns={"A": "a", "B": "b", "C": "c"}, errors="ignore")
# in data there is no 'C' column but default error on .rename() is ignore

   a  b
0  1  4
1  2  5
2  3  6

# **Groupby**

# **Combine Data**

The last set of basic Pandas commands are for joining or combining data frames or rows/columns. The three commands are:

## **.concat()**

## **.merge()**

## **.append()**

df.append(other, ignore_index=False, verify_integrity=False, sort=False)

Parameters
...........

* other : DataFrame or Series/dict-like object, or list of these

The data to append.

* ignore_index : bool, default False

If True, do not use the index labels.

* verify_integrity : bool, default False

If True, raise ValueError on creating index with duplicates.

* sort : bool, default False

Sort columns if the columns of `self` and `other` are not aligned.




df1.append(df2)â€” add the rows in df1 to the end of df2 (columns should be identical)

In [130]:
# df.append?

In [131]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [132]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [133]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

In [134]:
# With `ignore_index` set to True:
df.append(df2, ignore_index=True)

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

In [135]:
# The following, while not recommended methods for generating DataFrames, show two ways to generate a DataFrame from multiple data sources.
df = pd.DataFrame(columns=['A'])
for i in range(5):
    df = df.append({'A': i}, ignore_index=True)
df

   A
0  0
1  1
2  2
3  3
4  4

In [136]:
# More efficient:
pd.concat([pd.DataFrame([i], columns=['A']) for i in range(5)],
           ignore_index=True)

   A
0  0
1  1
2  2
3  3
4  4

## **.join()**

# **.get_dummies()**